; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	image0 - mode
	thermograph1 - mode
	GroundStation3 - direction
	Star6 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation9 - direction
	Star8 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet14)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation7)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star6)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation9)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star8)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
	(supports instrument8 image0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation7)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 Star6)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star8)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation3)
	(supports instrument11 image0)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star8)
	(supports instrument12 thermograph1)
	(supports instrument12 image0)
	(calibration_target instrument12 GroundStation9)
	(calibration_target instrument12 Star5)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon13)
	(supports instrument13 thermograph1)
	(supports instrument13 image0)
	(calibration_target instrument13 Star4)
	(calibration_target instrument13 Star8)
	(supports instrument14 image0)
	(supports instrument14 thermograph1)
	(calibration_target instrument14 Star4)
	(supports instrument15 image0)
	(calibration_target instrument15 GroundStation7)
	(calibration_target instrument15 GroundStation0)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation2)
)
(:goal (and
	(pointing satellite2 Phenomenon13)
	(pointing satellite4 GroundStation2)
	(pointing satellite5 Planet12)
	(pointing satellite6 Star6)
	(pointing satellite7 Planet14)
	(have_image Star10 image0)
	(have_image Planet11 thermograph1)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 image0)
	(have_image Planet14 thermograph1)
))

)

; plan
1. (turn_to satellite7 planet14 groundstation2)
   deleted: (pointing satellite7 groundstation2)
   added: (pointing satellite7 planet14)
   goals met: 1 of 10
2. (turn_to satellite6 star6 phenomenon13)
   deleted: (pointing satellite6 phenomenon13)
   added: (pointing satellite6 star6)
   goals met: 2 of 10
3. (turn_to satellite5 planet12 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 planet12)
   goals met: 3 of 10
4. (turn_to satellite4 groundstation2 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 groundstation2)
   goals met: 4 of 10
5. (turn_to satellite2 phenomenon13 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 phenomenon13)
   goals met: 5 of 10
6. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 5 of 10
7. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 5 of 10
8. (turn_to satellite1 planet11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet11)
   goals met: 5 of 10
9. (take_image satellite1 planet11 instrument1 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 6 of 10
10. (turn_to satellite1 phenomenon13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon13)
   goals met: 6 of 10
11. (take_image satellite1 phenomenon13 instrument1 image0)
   added: (have_image phenomenon13 image0)
   goals met: 7 of 10
12. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 7 of 10
13. (take_image satellite1 planet12 instrument1 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 8 of 10
14. (turn_to satellite1 planet14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet14)
   goals met: 8 of 10
15. (take_image satellite1 planet14 instrument1 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 9 of 10
16. (turn_to satellite1 star10 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star10)
   goals met: 9 of 10
17. (take_image satellite1 star10 instrument1 image0)
   added: (have_image star10 image0)
   goals met: 10 of 10
